In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('test.csv', sep=';')

In [7]:
print("Dataset Shape:")
print(df.shape)
print("-" * 30)

Dataset Shape:
(418, 1)
------------------------------

In [8]:
print("First 5 rows of the dataset:")
display(df.head())
print("-" * 30)

First 5 rows of the dataset:

  PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0  892,3,"Kelly, Mr. James",male,34.5,0,0,330911,...
1  893,3,"Wilkes, Mrs. James (Ellen Needs)",femal...
2  894,2,"Myles, Mr. Thomas Francis",male,62,0,0,...
3  895,3,"Wirz, Mr. Albert",male,27,0,0,315154,8....
4  896,3,"Hirvonen, Mrs. Alexander (Helga E Lindq...

------------------------------

In [9]:
print("Column Information and Data Types:")
print(df.info())

Column Information and Data Types:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 1 columns):
 #   Column                                                                  Non-Null Count  Dtype
---  ------                                                                  --------------  -----
 0   PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked  418 non-null    object
dtypes: object(1)
memory usage: 3.4+ KB
None